import styles from './index.module.css';

// eslint-disable-next-line react-refresh/only-export-components
export async function clientLoader() {
  return { agreement: '', error: null };
}

export default function Agreement() {
  return (
    <div className={styles.agreement}>
      <h2>ПУБЛИЧНАЯ ОФЕРТА</h2>
      <p>от «20» августа 2024г.</p>
      <p>Индивидуальный предприниматель Кочетков Михаил Олегович,</p>
      <p>ИНН: 623412482291,</p>
      <p>ОГРНИП:325620000000329,</p>
      <p>
        именуемый в дальнейшем «Исполнитель», предлагает заключить оферту на
        получение физкультурно-оздоровительных услуг с любым совершеннолетним
        физическим лицом или юридическим лицом посредством совершения акцепта
        настоящей Оферты.{' '}
      </p>
      <p>
        В соответствии с пунктом 2 статьи 437 Гражданского Кодекса Российской
        Федерации (далее – ГК РФ) в случае принятия изложенных ниже условий и
        совершения акцепта, лицо, производящее акцепт настоящей Оферты,
        становится «Заказчиком».
      </p>
      <p>
        Согласно пункту 3 статьи 438 ГК РФ акцепт оферты равносилен заключению
        договора на условиях, изложенных в оферте.
      </p>
      <p>
        Внимательно прочитайте текст данной оферты и, если вы не согласны с
        каким-либо пунктом настоящей Оферты, Исполнитель предлагает вам
        отказаться от совершения каких-либо действий, необходимых для акцепта.
      </p>
      <ul>
        <li>
          <strong>I. Термины и определения</strong>
        </li>
        <li>
          Оферта – предложение Исполнителя, адресованное физическому лицу,
          заключить с Исполнителем договор на оказание платных услуг на
          условиях, содержащихся в настоящей Оферте, включая все Приложения.
        </li>
        <li>
          Акцепт оферты – полное и безоговорочное согласие Заказчика с условиями
          настоящей Оферты.{' '}
        </li>
        <li>
          Кемп — физкультурно-оздоровительное мероприятие, организуемое и
          проводимое Исполнителем в целях реализации предлагаемых по настоящей
          оферте Услуг.
        </li>
        <li>
          Цена — стоимость участия в кемпе определяется на соответствующей
          странице на Сайте Исполнителя. Исполнитель вправе устанавливать
          различные скидки от стоимости участия в Кемпе.{' '}
        </li>
        <li>
          На момент выбора Заказчиком варианта оплаты стоимость является
          окончательной и изменению не подлежит.
        </li>
        <li>Исполнитель — ИП Кочетков Михаил Олегович.</li>
        <li>Заказчик — физическое лицо, совершившее акцепт данной Оферты.</li>
        <li>
          Персональные данные Заказчика — любая информация в соответствии с
          Федеральным законом «О персональных данных», полученная Исполнителем
          от Заказчика при направлении заявки на участие в кемпе и/или в
          процессе участия в кемпе.
        </li>
        <li>
          Политика обработки персональных данных — документ, на основании
          которого Оператор обработки персональных данных осуществляет обработку
          данных Исполнителя.
        </li>
        <li>
          Согласие на обработку персональных данных — документ, являющийся
          основанием обработки персональных данных Заказчика.
        </li>
        <li>
          Согласие на рассылку электронных сообщений — документ, являющийся
          основанием для рассылки материалов рекламного и/или информационного
          характера посредством SMS-серверов и/или с электронной почты
          Исполнителя.
        </li>
        <li>
          Иные термины и определения, встречающиеся в тексте Договора, толкуются
          Сторонами в соответствии с законодательством Российской Федерации и
          сложившимися в сети Интернет обычными правилами толкования
          соответствующих терминов.
        </li>

        <li>
          <strong>II. Общие положения</strong>
        </li>
        <li>
          2.1. В соответствии с настоящей Офертой Исполнитель обязуется
          предоставить Заказчику физкультурно-оздоровительные услуги в виде
          участия Заказчика в организуемом Кемпе, а Заказчик обязуется уплатить
          Исполнителю вознаграждение за участие в организуемом Исполнителем
          Кемпе.
        </li>
        <li>
          2.2. Услуги направлены на удовлетворение потребностей Заказчика в
          получении физкультурно-оздоровительных услуг и удовлетворении
          потребностей Заказчика в физической активности.
        </li>
        <li>
          2.3. Настоящей Офертой Заказчик уведомлен, что результат освоения
          полученных физкультурных навыков зависит не только от Исполнителя, но
          и от усилий Заказчика.
        </li>
        <li>
          2.4. Совершение акцепта, влекущее заключение договора между
          Исполнителем и Заказчиком на оказание платных услуг осуществляется
          путем совершения Заказчиком следующих действий: заполнения заявки на
          получение услуги на сайте, содержащей в себе персональные данные
          заполнившего ее лица (телефонный номер), внесение частичной/полной
          оплаты стоимости участия в Кемпе.
        </li>
        <li>
          2.5. Моментом заключения договора на получение услуг признается дата
          совершения Заказчиком оплаты и заполнение необходимых персональных
          данных в заявке предоставленной Исполнителем.
        </li>
        <li>
          2.6. Кемп подразумевает участие Заказчика в группе, численность и
          состав которой определяется Исполнителем самостоятельно.
        </li>
        <li>
          2.7. Исполнитель оставляет за собой право изменять или дополнять любые
          из условий настоящей Оферты в любое время, опубликовывая все изменения
          на своем сайте, предварительно уведомив об этом Заказчика. Если
          опубликованные изменения для Заказчика неприемлемы, то он в течение 7
          (семи) календарных дней с момента опубликования изменений должен
          уведомить об этом Исполнителя письменно. Если уведомления не
          поступило, то считается, что Заказчик продолжает принимать участие в
          договорных отношениях на новых условиях.
        </li>
        <li>
          2.8. Время и место оказания услуг определяются Исполнителем
          самостоятельно.
        </li>

        <li>
          <strong>III. Порядок и условия предоставления услуг</strong>
        </li>
        <li>
          3.1. Для предоставления услуг Заказчик оставляет заявку на сайте.
        </li>
        <li>
          Для оформления заявки Заказчик предоставляет свои персональные данные:
          номер телефона, имя и фамилию.
        </li>
        <li>
          3.2. После заполнения всех полей для подачи заявки, лицо, желающее
          получить Услугу, подтверждает правильность и достоверность указанных
          им данных и выражает желание подать заявку путем поля такого типа как
          « записаться! »
        </li>
        <li>
          3.3. Совершая акцепт настоящей Оферты, Заказчик свободно и своей волей
          и в своем интересе дает согласие Исполнителю на обработку
          предоставленных Заказчиком персональных данных.{' '}
        </li>
        <li>
          Согласие считается отозванным в случае досрочного расторжения
          настоящего Договора по любой причине или в случае направления
          Заказчиком отказа от согласия на обработку персональных данных на
          электронную почту: mook009@mail.ru
        </li>
        <li>
          3.4. После заполнения Заявки, Исполнитель/представитель Исполнителя
          связывается с Заказчиком и предоставляет ему возможность оплатить
          услугу, направив платежный документ (или направив реквизиты для
          оплаты, в случае если Заказчик является юридическим лицом).
        </li>

        <li>
          <strong>IV. Тарифы и стоимость оказываемых услуг</strong>
        </li>
        <li>
          4.1. Стоимость оказываемых Услуг отображается на сайте Исполнителя.
        </li>
        <li>
          4.2. Оплата стоимости Услуг осуществляется безналичным расчётом после
          заполнения заявки и консультации с Исполнителем/представителем
          Исполнителя, содержащей персональные данные Заказчика.{' '}
        </li>
        <li>
          Посредством внесения оплаты на основе сформированного Исполнителем
          платежного документа.
        </li>
        <li>
          В стоимость оплаты услуг включена комиссия, взимаемая с Заказчика
          платежной системой.
        </li>
        <li>
          Также может осуществляться оплата путем оформления рассрочки (договора
          потребительского кредита/займа).{' '}
        </li>
        <li>
          При оформлении Заказчиком договора потребительского кредита все
          условия кредитного договора согласуются непосредственно в договоре
          между Заказчиком и кредитной организацией (Банком).{' '}
        </li>
        <li>
          Исполнитель не несет ответственности за условия кредитного договора.
          Заказчик не может предъявлять в адрес Исполнителя какие-либо претензии
          и/или требования связанные с условиями кредитного договора.{' '}
        </li>
        <li>
          4.3. Обязательство Заказчика по оплате считается исполненным в момент
          зачисления денежных средств на счет Исполнителя и заполнения заявки на
          Сайте, содержащей персональные данные Заказчика.
        </li>
        <li>
          4.4. Для бронирования места Заказчика на мероприятии достаточно
          внесения до 30% от стоимости услуги.{' '}
        </li>
        <li>
          Правила возврата денежных средств прописаны в Приложении № 1 к
          настоящей Оферте. Совершая акцепт Оферты, Заказчик выражает полное и
          безоговорочное согласие с Правилами изложенными в Приложении № 1.
        </li>
        <li>
          4.5. Получая предоплату в счет оплаты стоимости участия в Кемпе,
          Исполнитель гарантирует Заказчику:
        </li>
        <li>
          - фиксацию стоимости по цене, указанной на момент предложения, с
          момента внесения предоплаты Заказчиком;
        </li>
        <li>
          - оказание Заказчику услуг в соответствии с условиями настоящей
          Оферты;
        </li>
        <li>- бронирование места Заказчика на участие в Кемпе.</li>

        <li>
          <strong>V. Права и обязанности сторон</strong>
        </li>
        <li>
          5.1. Исполнитель оказывает Заказчику услуги по организации и
          проведению физкультурно-оздоровительного мероприятия — Кемпа.
        </li>
        <li>
          5.2. Исполнитель самостоятельно определяет необходимость привлечения
          третьих лиц для оказания услуг.
        </li>
        <li>
          5.3. Исполнитель вправе самостоятельно определять график активности в
          день проведения мероприятия.{' '}
        </li>
        <li>
          5.4. Заказчик обязан неукоснительно и безоговорочно соблюдать
          следующие Правила поведения при получении Услуг:
        </li>
        <li>
          - соблюдать дисциплину и общепринятые нормы поведения, в частности,
          проявлять уважение к помощникам Исполнителя, к Исполнителю и другим
          Заказчикам, не посягать на их честь и достоинство;
        </li>
        <li>
          - не допускать агрессивного поведения во время оказания услуг, не
          мешать Исполнителю или другим Заказчикам при оказании/получении Услуг;
        </li>
        <li>
          - не использовать информацию, полученную от Исполнителя, способами,
          которые могут привести или приведут к нанесению ущерба интересам
          Исполнителя;
        </li>
        <li>
          - не использовать ненормативную лексику, не употреблять в общении
          выражения, которые могут оскорбить Исполнителя или других Заказчиков;
        </li>
        <li>
          - не распространять рекламу и не предлагать услуги сторонних ресурсов,
          свои услуги или услуги третьих лиц.
        </li>
        <li>
          5.5. Исполнитель имеет право прекращать/не приступать к оказанию
          услуг, а также приостанавливать оказание услуг, к которым он
          фактически приступил, в случаях нарушения Заказчиком своих
          обязательств по настоящему Договору, а именно:
        </li>
        <li>- неполной (ненадлежащей, несвоевременной) оплаты;</li>
        <li>
          - непредставления персональных, регистрационных или иных данных при
          заполнении заявки, необходимых для предоставления услуг;
        </li>
        <li>- в случае нарушение п. 5.4 настоящей Оферты;</li>
        <li>
          5.6. Заказчик обязан самостоятельно оценивать свое физическое
          состояние и психическое состояние, свою готовность к участию в Кемпе.
        </li>
        <li>
          5.7. Заказчик обязан самостоятельно и ответственно контролировать свое
          собственное здоровье и не ставить под угрозу здоровье окружающих. При
          наличии хронических, инфекционных, кожных заболеваний, а также
          болезней внутренних органов воздержаться от участия в Кемпе.
        </li>
        <li>
          5.7. Заказчик обязан соблюдать рекомендации Исполнителя/представителей
          Исполнителя во время оказания услуг.
        </li>
        <li>5.8. Порядок расторжения акцептованного договора:</li>
        <li>
          - Заказчик направляет Исполнителю на электронную mook009@mail.ru
          заявление о желании расторгнуть договор в письменном виде, изложенное
          в свободной форме.
        </li>
        <li>
          - Исполнитель немедленно реагирует на поступившее заявление и в
          течение 3 (трех) рабочих дней с момента получения заявления по
          согласованию с Заказчиком принимает решение о расторжении договора и о
          возврате денежных средств, полученных от Заказчика.
        </li>
        <li>
          - По истечении 3 (трех) рабочих дней с момента получения Исполнителем
          заявления Заказчика о расторжении договора, договор считается
          расторгнутым.
        </li>
        <li>
          5.9. Заказчик уведомлен о том, что при возврате денежных средств за
          неоказанные услуги комиссия, взимаемая банком при оплате услуг на
          сайте возврату не подлежит.
        </li>
        <li>
          5.10. Согласие на обработку персональных данных, а также согласие на
          получение информационной и(или) рекламной рассылки может быть отозвано
          Заказчиком в любое время после заключения договора на оказание платных
          услуг на основании настоящей Оферты посредством направления отзыва
          согласия на адрес электронной почты: mook009@mail.ru{' '}
        </li>

        <li>
          <strong>
            VI. Порядок урегулирования споров и ответственность сторон
          </strong>
        </li>
        <li>
          6.1. Исполнитель не несет ответственности за несоответствие
          предоставленной услуги ожиданиям Заказчика и(или) за его субъективную
          оценку.
        </li>
        <li>
          6.2. Несоответствие ожиданиям и (или) отрицательная субъективная
          оценка не являются основаниями считать услуги оказанными некачественно
          или не в согласованном объеме. Также не являются такими основаниями
          мнения третьих лиц, отличные от мнения Исполнителя (и(или) его
          партнеров).
        </li>
        <li>
          6.3. В случае, если Заказчик, по причинам, не зависящим от
          Исполнителя, не воспользовался Услугами и не уведомил Исполнителя о
          своем желании отказаться от Услуг в порядке, предусмотренном настоящей
          Офертой, Услуги считаются оказанными.
        </li>
        <li>
          6.4. Все споры и разногласия, возникшие в связи с исполнением договора
          на оказание платных услуг, заключенного посредством совершения
          Заказчиком акцепта настоящей Оферты, решаются Сторонами путем
          переговоров. Досудебный порядок урегулирования спора состоит из
          направления Заказчиком претензии в письменной форме на электронный
          адрес Исполнителя.
        </li>
        <li>
          6.5. Исполнитель не несет ответственности за возможные травмы и/или
          проблемы со здоровьем, которые могут возникнуть у Заказчика в процессе
          получения услуг.
        </li>

        <li>
          <strong>VII. Прочие условия</strong>
        </li>
        <li>
          7.1. Настоящая Оферта вступает в силу с момента ее Акцепта и действует
          до момента окончания оказания услуг в соответствии с настоящей
          офертой.
        </li>
        <li>
          7.2. Стороны подтверждают, что информация, которой они обмениваются в
          рамках подготовки, а также в процессе исполнения настоящей Оферты,
          носит конфиденциальный характер.
        </li>
        <li>
          7.3. Заказчик, акцептуя Оферту, дает согласие на обработку своих
          персональных данных в соответствии с положениями Федерального закона
          от 27.07.2006 № 152-ФЗ «О персональных данных».
        </li>
        <li>
          7.4. В вопросах, не предусмотренных настоящей Офертой, Стороны
          руководствуются действующим законодательством Российской Федерации.
        </li>

        <li>
          <strong>
            VIII. Заключение, изменение и расторжение настоящего договора
          </strong>
        </li>
        <li>
          8.1. Настоящий договор считается заключенным с момента зачисления на
          расчетный счет Исполнителя денежных средств, уплаченных Заказчиком в
          счет оплаты заказанных им услуг, а также заполнения заявки на Сайте,
          содержащей персональные данные Заказчика, необходимой для
          предоставления услуг.
        </li>
        <li>
          8.2. Договор может быть расторгнут досрочно по соглашению Сторон или в
          одностороннем порядке в случаях, предусмотренных законодательством
          Российской Федерации.
        </li>
        <li>
          8.3. Стороны в праве расторгнуть Договор по взаимному согласию в любой
          момент до фактического исполнения Договора.
        </li>
        <li>ИСПОЛНИТЕЛЬ:</li>
        <li>Индивидуальный предприниматель Кочетков Михаил Олегович, </li>
        <li>ИНН: 623412482291, </li>
        <li>ОГРНИП:325620000000329, </li>
        <li>Приложение № 1 к Оферте</li>
        <li>
          Правила отмены участия и возврата денежных средств указаны в
          соответствии с условиями Публичной оферты.
        </li>
        <li>
          Бронируя место на кемпе путем внесения аванса, участники соглашаются с
          условиями Публичной оферты.
        </li>
        <li>Кемпы на выходные:</li>
        <li>- Бронирование места осуществляется при оплате до 30%;</li>
        <li>- Полная оплата не позднее чем за 7 дней до начала мероприятия;</li>
        <li>
          - При отмене более чем 14 дней, возврат оплаты с удержанием 2000р за
          услугу бронирования;
        </li>
        <li>- При отмене за 14 - 7 дней до начала 30% удержание;</li>
        <li>- При отмене менее, чем за 7 дней до мероприятия удержание 70%;</li>
        <li>
          - При отмене менее 3 дней до мероприятия оплата не возвращается;
        </li>
        <li>- Депозит отсутствует.</li>
        <li>(Приложение 1)</li>
        <li>- Бронирование места осуществляется при оплате 30%;</li>
        <li>
          - Полная оплата не позднее чем за 10 дней до начала мероприятия;
        </li>
        <li>
          - При отмене более чем 20 дней возврат оплаты с удержанием 3000р за
          услугу бронирования;
        </li>
        <li>- При отмене за 20-10 дней до начала 30% удержание;</li>
        <li>- При отмене 10-5 дней 70% удержание;</li>
        <li>
          - При отмене менее 5 дней до мероприятия оплата не возвращается;
        </li>
        <li>- Депозит отсутствует.</li>
      </ul>
    </div>
  );
}
