import styles from './index.module.css';

// eslint-disable-next-line react-refresh/only-export-components
export async function clientLoader() {
  return { persanal: [] };
}

export default function Persanal() {
  return (
    <div className={styles.agreement}>
      <h2>ПОЛИТИКА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>
      <ul>
        <li>
          <strong>1. Общие положения</strong>
        </li>
        <li>
          1.1 Индивидуальный предприниматель Кочетков Михаил Олегович, ИНН:
          623412482291, ОГРНИП: 325620000000329 (далее по тексту – Оператор)
          ставит соблюдение прав и свобод граждан одним из важнейших условий
          осуществления своей деятельности.
        </li>
        <li>
          1.2 Политика Оператора в отношении обработки персональных данных
          (далее по тексту — Политика) применяется ко всей информации, которую
          Оператор может получить о посетителях веб-сайта magicvolley.ru
          Персональные данные обрабатывается в соответствии с ФЗ «О персональных
          данных» № 152-ФЗ.
        </li>

        <li>
          <strong>2. Основные понятия, используемые в Политике:</strong>
        </li>
        <li>
          2.1 Веб-сайт - совокупность графических и информационных материалов, а
          также программ для ЭВМ и баз данных, обеспечивающих их доступность в
          сети интернет по сетевому адресу magicvolley.ru;
        </li>
        <li>2.2 Пользователь – любой посетитель веб-сайта magicvolley.ru;</li>
        <li>
          2.3 Персональные данные – любая информация, относящаяся к Пользователю
          веб-сайта magicvolley.ru
        </li>
        <li>
          2.4 Обработка персональных данных - любое действие с персональными
          данными, совершаемые с использованием ЭВМ, равно как и без их
          использования;
        </li>
        <li>
          2.5 Обезличивание персональных данных – действия, результатом которых
          является невозможность без использования дополнительной информации
          определить принадлежность персональных данных конкретному Пользователю
          или лицу;
        </li>
        <li>
          2.6 Распространение персональных данных – любые действия, результатом
          которых является раскрытие персональных данных неопределенному кругу
          лиц;
        </li>
        <li>
          2.7 Предоставление персональных данных – любые действия, результатом
          которых является раскрытие персональных данных определенному кругу
          лиц;
        </li>
        <li>
          2.8 Уничтожение персональных данных – любые действия, результатом
          которых является безвозвратное уничтожение персональных на ЭВМ или
          любых других носителях.
        </li>

        <li>
          <strong>
            3. Оператор может обрабатывать следующие персональные данные:
          </strong>
        </li>
        <li>3.1 Адрес электронной почты Пользователя</li>
        <li>3.2 Номер телефона Пользователя</li>
        <li>3.3. Фамилию, имя, отчество Пользователя</li>
        <li>
          3.4. Также на сайте происходит сбор и обработка обезличенных данных о
          посетителях (в т.ч. файлов «cookie») с помощью сервисов
          интернет-статистики (Яндекс Метрика и Гугл Аналитика и других). 
        </li>
        <li>
          <strong>4. Цели обработки персональных данных</strong>
        </li>
        <li>
          4.1 Цель обработки адреса электронной почты, номера телефона, фамилии,
          имени, отчества Пользователя - уточнение деталей заявки. Также
          Оператор имеет право направлять Пользователю уведомления о новых
          продуктах и услугах, специальных предложениях и различных событиях.
          Пользователь всегда может отказаться от получения информационных
          сообщений, направив Оператору письмо на адрес mook009@mail.ru.
        </li>
        <li>
          4.2 Обезличенные данные Пользователей, собираемые с помощью сервисов
          интернет-статистики, служат для сбора информации о действиях
          Пользователей на сайте, улучшения качества сайта и его содержания.
        </li>

        <li>
          <strong>5. Правовые основания обработки персональных данных</strong>
        </li>
        <li>
          5.1 Оператор обрабатывает персональные данные Пользователя только в
          случае их отправки Пользователем через формы, расположенные на сайте
          magicvolley.ru. Отправляя свои персональные данные Оператору,
          Пользователь выражает свое согласие с данной Политикой.
        </li>
        <li>
          5.2 Оператор обрабатывает обезличенные данные о Пользователе в случае,
          если это разрешено в настройках браузера Пользователя (включено
          сохранение файлов «cookie» и использование технологии JavaScript).
        </li>

        <li>
          <strong>
            6. Порядок сбора, хранения, передачи и других видов обработки
            персональных данных
          </strong>
        </li>
        <li>
          6.1 Оператор обеспечивает сохранность персональных данных и принимает
          все возможные меры, исключающие доступ к персональным данным
          неуполномоченных лиц.
        </li>
        <li>
          6.2 Персональные данные Пользователя никогда, ни при каких условиях не
          будут переданы третьим лицам, за исключением случаев, связанных с
          исполнением действующего законодательства.
        </li>
        <li>
          6.3. В случае выявления неточностей в персональных данных,
          Пользователь может актуализировать их, направив Оператору уведомление
          с помощью электронной почты на электронный адрес Оператора
          mook009@mail.ru, с пометкой «Актуализация персональных данных»
        </li>
        <li>
          6.3 Срок обработки персональных данных является неограниченным.
          Пользователь может в любой момент отозвать свое согласие на обработку
          персональных данных, направив Оператору уведомление с помощью
          электронной почты на электронный адрес Оператора mook009@mail.ru, с
          пометкой «Отзыв согласия на обработку персональных данных».
        </li>

        <li>
          <strong>7. Заключительные положения</strong>
        </li>
        <li>
          7.1. Пользователь может получить любые разъяснения по интересующим
          вопросам, касающимся обработки его персональных данных, обратившись к
          Оператору с помощью электронной почты mok009@mail.ru.
        </li>
        <li>
          7.2. В данном документе будут отражены любые изменения политики
          обработки персональных данных Оператором. В случае существенных
          изменений Пользователю может быть выслана информация на указанный им
          электронный адрес.
        </li>
      </ul>
    </div>
  );
}
