import styles from './index.module.css';

// eslint-disable-next-line react-refresh/only-export-components
export async function clientLoader() {
  return { persanal: '', error: null };
}

export default function Persanal() {
  return (
    <div className={styles.agreement}>
      <h2>Пользовательское соглашение об обработке персональных данных</h2>

      <h3>
        Настоящее Пользовательское соглашение (далее — Соглашение) регулирует
        отношения между <i>magicvolley.ru</i>, именуемым в дальнейшем
        «Администратор», и Пользователями, использующими веб-сайт{' '}
        <i>https://magicvolley.ru/</i> далее — Сайт).
      </h3>
      <ul>
        <li>
          <strong>1. Общие положения</strong>
        </li>

        <li>
          1.1. Настоящим Соглашением устанавливаются правила и условия
          использования Сайта, включая обработку персональных данных
          Пользователей.
        </li>

        <li>
          1.2. Пользуясь Сайтом, Пользователь выражает свое согласие с условиями
          настоящего Соглашения и подтверждает, что ознакомился с ними в полном
          объеме.
        </li>

        <li>
          1.3. Администратор оставляет за собой право вносить изменения в
          настоящее Соглашение. Новая редакция вступает в силу с момента её
          публикации на Сайте.
        </li>

        <li>
          <strong>2. Персональные данные</strong>
        </li>

        <li>
          2.1. Под персональными данными понимаются любые сведения, относящиеся
          прямо или косвенно к определенному или определяемому физическому лицу
          (субъекту персональных данных). К таким данным относятся имя, фамилия,
          адрес электронной почты, номер телефона, IP-адрес и другие подобные
          сведения.
        </li>

        <li>
          2.2. В процессе использования Сайта Пользователь добровольно передает
          свои персональные данные, необходимые для выполнения действий,
          связанных с предоставлением услуг через Сайт, таких как регистрация
          аккаунта, оформление заказов, подписка на рассылку новостей и пр.
        </li>

        <li>
          <strong>3. Цели сбора и обработки персональных данных</strong>
        </li>

        <li>
          3.1. Персональные данные Пользователей собираются и обрабатываются
          исключительно для целей обеспечения функционирования Сайта и
          предоставления пользователям соответствующих услуг.
        </li>

        <li>
          3.2. Конкретные цели обработки персональных данных включают:
          Идентификация Пользователя в рамках использования Сайта; Обеспечение
          возможности связи с Пользователем; Оформление и выполнение заказов;
          Предоставление Пользователю персонализированных сервисов и
          предложений; Анализ статистики посещаемости Сайта; Рассылка
          информационных материалов и рекламных сообщений с согласия
          Пользователя.
        </li>

        <li>
          <strong>4. Способы и сроки хранения персональных данных</strong>
        </li>

        <li>
          4.1. Персональные данные хранятся на серверах Администрации и/или
          третьих лиц, обеспечивающих техническое сопровождение Сайта.
        </li>

        <li>
          4.2. Срок хранения персональных данных определяется необходимостью
          достижения целей, указанных в п. 3 настоящего Соглашения, либо
          требованиями законодательства РФ.
        </li>

        <li>
          4.3. По истечении срока хранения персональные данные подлежат удалению
          или обезличиванию.
        </li>

        <li>
          <strong>5. Передача персональных данных третьим лицам</strong>
        </li>

        <li>
          5.1. Администратор вправе передавать персональные данные Пользователя
          третьим лицам только в случаях, предусмотренных законодательством РФ,
          а также в целях исполнения обязательств перед Пользователем.
        </li>

        <li>
          5.2. Администратор обязуется принимать меры для защиты персональных
          данных от несанкционированного доступа, утраты, искажения или
          уничтожения.
        </li>

        <li>
          <strong>6. Права субъектов персональных данных</strong>
        </li>

        <li>
          6.1. Пользователь имеет право: Требовать уточнения, блокирования или
          уничтожения своих персональных данных, если эти данные являются
          неполными, устаревшими, недостоверными, незаконно полученными или не
          являются необходимыми для заявленной цели обработки; Отозвать своё
          согласие на обработку персональных данных путем направления
          соответствующего уведомления Администраторам Сайта; Получать
          информацию относительно порядка обработки своих персональных данных.
        </li>

        <li>
          6.2. Для реализации прав, перечисленных в настоящем пункте,
          Пользователь направляет письменный запрос на электронную почту
          администратора Сайта cazina2013@yandex.ru.
        </li>

        <li>
          <strong>7. Ответственность сторон</strong>
        </li>

        <li>
          7.1. За нарушение условий настоящего Соглашения стороны несут
          ответственность в соответствии с законодательством Российской
          Федерации.
        </li>

        <li>
          7.2. Администратор не несет ответственности за возможные убытки,
          понесённые Пользователем вследствие предоставления неверной или
          недостаточной информации о себе.
        </li>

        <li>
          <strong>8. Заключительные положения</strong>
        </li>

        <li>
          8.1. Настоящее Соглашение регулируется и толкуется в соответствии с
          законодательством Российской Федерации.
        </li>

        <li>
          8.2. Все споры, возникающие из настоящего Соглашения или связанные с
          ним, разрешаются путем переговоров. Если стороны не смогут прийти к
          соглашению, спор подлежит разрешению в судебном порядке в соответствии
          с законодательством РФ.
        </li>

        <li>
          8.3. Настоящее Соглашение вступает в силу с момента его опубликования
          на Сайте и действует до тех пор, пока оно не будет отменено или
          заменено новой версией.
        </li>
      </ul>

      <p>
        Подтверждая своё согласие с настоящим Соглашением, Пользователь
        удостоверяет, что он ознакомлен с условиями обработки персональных
        данных и согласен с ними.
      </p>
    </div>
  );
}
